src/Documents/ПередачаВозвратовОрганизатору/ПередачаВозвратовОрганизатору.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПередачаВозвратовОрганизатору</name>
  <registerRecords>AccumulationRegister.Расход</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн_Ошибки</registerRecords>
  <registerRecords>AccumulationRegister.Возвраты</registerRecords>
  <attributes>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Организаторы</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Участники</types>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыУчастников</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Покупки</name>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>CatalogRef.Покупки</types>
        <types>CatalogRef.Заказы</types>
        <types>CatalogRef.Посылки</types>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.ВозвратГруппОрганизатору</types>
        <types>DocumentRef.ВозвратПокупокОрганизатору</types>
        <types>DocumentRef.ДвижениеТранзита</types>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/Возвраты/Возвраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Возвраты</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Участники</types>
      <types>CatalogRef.Организаторы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Покупка</name>
    <type>
      <types>CatalogRef.Покупки</types>
      <types>CatalogRef.Заказы</types>
      <types>CatalogRef.Посылки</types>
      <types>CatalogRef.Коробки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ВозвратГруппОрганизатору</types>
      <types>DocumentRef.ВозвратПокупокОрганизатору</types>
      <types>DocumentRef.КорректировкаЗаписейРегистров</types>
      <types>DocumentRef.ДвижениеТранзита</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Catalogs/Мегаордера/Мегаордера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Мегаордера</name>
  <predefined>
    <items>
      <name>нулевой</name>
    </items>
  </predefined>
  <attributes>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупка</name>
    <type>
      <types>CatalogRef.Покупки</types>
      <types>DocumentRef.ВыдачаТранзита</types>
      <types>CatalogRef.Заказы</types>
      <types>CatalogRef.Посылки</types>
      <types>CatalogRef.Пристрой</types>
      <types>CatalogRef.Коробки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктВыдачи</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Организаторы</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПерваяТочкаПриема</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>типМегаордера</name>
    <type>
      <types>EnumRef.типМегаордера</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Коробка</name>
    <type>
      <types>CatalogRef.Коробки</types>
    </type>
  </attributes>
  <attributes>
    <name>Посылка</name>
    <type>
      <types>CatalogRef.Посылки</types>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.ВыдачаТранзита</types>
      <types>DocumentRef.УпаковатьЗаказы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Маршрут</name>
    <attributes>
      <name>ТранспортнаяКомпания</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрэкНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставкиПлан</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставкиФакт</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DefinedType.ТипыЗаказа</types>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/ПередачаВозвратовОрганизатору/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	#Область ПравильноеПроведение
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	Документы.ПередачаВозвратовОрганизатору.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	ДополнительныеСвойства.Вставить("ЭтоНовый",ЭтоНовый());
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
//	СтоСПОбмен_Общий.ОтразитьСтоСПОбмен(ДополнительныеСвойства, Движения, Отказ);
	
	СтоСПОбмен_Общий.ОтразитьСтоСПОбмен_РН(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСерверСП.ОтразитьДвиженияПоТаблице(ДополнительныеСвойства, Движения, "Возвраты", Отказ);
	ПроведениеСерверСП.ОтразитьДвиженияПоТаблице(ДополнительныеСвойства, Движения, "Расход", Отказ);

	#КонецОбласти
	
	
	//Движения.Возвраты.Записывать = Истина;
	//Для Каждого ТекСтрокаПокупки Из Покупки Цикл
	//	Движение = Движения.Возвраты.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//	Движение.Период = Дата;
	//	Движение.Организатор = Организатор;
	//	Движение.Участник = ТекСтрокаПокупки.Участник;
	//	Движение.МестоХранения=ТекСтрокаПокупки.МестоХранения;
	//	Движение.Покупка = ТекСтрокаПокупки.Покупка;
	//	Движение.Количество = ТекСтрокаПокупки.Количество;
	//	Движение.Партия=ТекСтрокаПокупки.Партия;
	//КонецЦикла;

КонецПроцедуры

Процедура заполнитьОстатками() экспорт
	Если Проведен Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя заполнить проведенный документ!!!");	
		Возврат;
	Иначе	
	Покупки.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВозвратыОстатки.Организатор КАК Организатор,
		|	ВозвратыОстатки.Участник КАК Участник,
		|	ВозвратыОстатки.Покупка КАК Покупка,
		|	ВозвратыОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ВозвратыОстатки.МестоХранения КАК МестоХранения,
		|	ВозвратыОстатки.Партия КАК Партия,
		|	ВозвратыОстатки.СуммаОстаток КАК Сумма
		|ПОМЕСТИТЬ пред
		|ИЗ
		|	РегистрНакопления.Возвраты.Остатки(, Организатор = &Организатор) КАК ВозвратыОстатки
		|ГДЕ
		|	ВозвратыОстатки.КоличествоОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	пред.Организатор КАК Организатор,
		|	пред.Участник КАК Участник,
		|	пред.Покупка КАК Покупка,
		|	пред.КоличествоОстаток КАК Количество,
		|	пред.МестоХранения КАК МестоХранения,
		|	пред.Партия КАК Партия,
		|	ВЫРАЗИТЬ(МАКСИМУМ(Мегаордера.Ссылка) КАК Справочник.Мегаордера) КАК ШК,
		|	пред.Сумма КАК Сумма
		|ИЗ
		|	пред КАК пред
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мегаордера КАК Мегаордера
		|		ПО пред.Покупка = Мегаордера.Покупка
		|			И (ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(пред.Покупка) = ТИП(Справочник.Коробки)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ пред.Участник = Мегаордера.Участник
		|			КОНЕЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	пред.Покупка,
		|	пред.Участник,
		|	пред.МестоХранения,
		|	пред.Организатор,
		|	пред.Партия,
		|	пред.КоличествоОстаток,
		|	пред.Сумма";

	Запрос.УстановитьПараметр("СуммаЗаВозвратОрганизатору", Константы.СтоимостьВозвратаТКДляОрганизатора.Получить());
	Запрос.УстановитьПараметр("Организатор", Организатор);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	
		СтрПокупки=Покупки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрПокупки,ВыборкаДетальныеЗаписи);
	
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ШК) Тогда Продолжить; КонецЕсли;
		
		СтрПокупки.ШК	= СП_Штрихкоды.ПолучитьМегаордер(ВыборкаДетальныеЗаписи.Покупка,ВыборкаДетальныеЗаписи.Участник);
	КонецЦикла;

	КонецЕсли;
	

КонецПроцедуры
